#2. Даны два числа. Показать большее и меньшее число
a = 6
b = 2
if b > a:
    max = b
    min = a
else:
    max = a
    min = b
print(f"max = {max},  min = {min}")

